app/views/home/index.html.erb

SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1
SELECT  `requested_jobs`.* FROM `requested_jobs` WHERE `requested_jobs`.`emp_id` = NULL AND `requested_jobs`.`job_id` = 1 LIMIT 1
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`id` = 1 LIMIT 1
---
						<%if user_signed_in?%>
							<%member_tmp=Member.find_by_user_id(current_user.id)%>
							<%unless member_tmp == nil%>
							<% if RequestedJob.find_by_emp_id_and_job_id(member_tmp.id,job.id) == nil%>
								<div class="w3-container w3-padding-8">
								<%@company_details=CompanyDetail.find(job.company_id)%>