app/views/experiences/_form.html.erb

  <div class="field">
    <%tmp=Member.find_by_user_id(current_user.id)%>
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1