app/views/company_details/_form.html.erb

SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 4 LIMIT 1
---
    <div class="field">
      <%tmp=Member.find_by_user_id(current_user.id)%>