app/views/company_details/show.html.erb


<%@job_posts = JobPost.where(:company_id=>@company_detail.id)%>
---
SELECT  `job_posts`.* FROM `job_posts` WHERE `job_posts`.`company_id` = 1 LIMIT 1

      <tr>
        <% tmp = CompanyDetail.find(job_post.company_id) %>
---
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`id` = 1 LIMIT 1