app/views/job_posts/_form.html.erb

SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1
---
  <div class="field">
    <%member=Member.find_by_user_id(current_user.id)%>