app/views/job_posts/index.html.erb

      <tr>
        <% tmp = CompanyDetail.find(job_post.company_id) %>
---
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`id` = 1 LIMIT 1