app/views/education_qualifications/_form.html.erb

  <div class="field">
    <%member=Member.find_by_user_id(current_user.id)%>
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1