app/controllers/company_details_controller.rb

  def index
    if Member.find_by_user_id(current_user.id) != nil
      me=Member.find_by_user_id(current_user.id)
      @company_details = CompanyDetail.where(:member_id=>me.id)
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def new
    if Member.find_by_user_id(current_user.id) != nil
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 4 LIMIT 1

  def create
    @company_detail = CompanyDetail.new(company_detail_params)

    respond_to do |format|
      if @company_detail.save
---
INSERT INTO `company_details` (`name`, `address`, `keyword`, `description`, `url`, `created_at`, `updated_at`) VALUES ('rk', '', 'programging', '', 'www.rk.com', '2017-02-07 18:47:36', '2017-02-07 18:47:36')

  def update
    respond_to do |format|
      if @company_detail.update(company_detail_params)
---
UPDATE `company_details` SET `address` = 'Chennai', `description` = 'great', `updated_at` = '2017-02-07 19:00:26' WHERE `company_details`.`id` = 1

    def set_company_detail
      @company_detail = CompanyDetail.find(params[:id])
---
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`id` = 1 LIMIT 1