app/controllers/education_qualifications_controller.rb

  def index
    if Member.find_by_user_id(current_user.id) != nil
      me=Member.find_by_user_id(current_user.id)
      @education_qualifications = EducationQualification.where(:member_id=>me.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @education_qualification = EducationQualification.new(education_qualification_params)

    respond_to do |format|
      if @education_qualification.save
---
INSERT INTO `education_qualifications` (`intitution_name`, `passed_out`, `percentage`, `created_at`, `updated_at`) VALUES ('veltech', '2014', 60, '2017-02-08 06:49:44', '2017-02-08 06:49:44')

  def destroy
    @education_qualification.destroy
---
DELETE FROM `education_qualifications` WHERE `education_qualifications`.`id` = 1

    def set_education_qualification
      @education_qualification = EducationQualification.find(params[:id])
---
SELECT  `education_qualifications`.* FROM `education_qualifications` WHERE `education_qualifications`.`id` = 2 LIMIT 1