app/controllers/experiences_controller.rb

SELECT `experiences`.* FROM `experiences`
---
  def index
    @experiences = Experience.all

INSERT INTO `experiences` (`company_name`, `worked_as`, `description`, `experience`, `created_at`, `updated_at`) VALUES ('Corn', 'Employee', 'not to bad', '2', '2017-02-09 17:48:11', '2017-02-09 17:48:11')
---
  def create
    @experience = Experience.new(experience_params)

    respond_to do |format|
      if @experience.save

UPDATE `experiences` SET `member_id` = 3, `updated_at` = '2017-02-09 18:09:11' WHERE `experiences`.`id` = 1
---
  def update
    respond_to do |format|
      if @experience.update(experience_params)

SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`id` = 1 LIMIT 1
---
    def set_experience
      @experience = Experience.find(params[:id])