app/controllers/home_controller.rb

SELECT `job_posts`.* FROM `job_posts`
SELECT `company_details`.* FROM `company_details`
---
  def index
    @job_posts=JobPost.all
    @company_details=CompanyDetail.all

SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1
INSERT INTO `requested_jobs` (`emp_id`, `job_id`, `created_at`, `updated_at`, `company_id`) VALUES (3, 1, '2017-02-08 06:39:16', '2017-02-08 06:39:16', 1)
---
  def create
    member=Member.find_by_user_id(current_user.id)
    tmp=RequestedJob.create(emp_id: member.id,company_id: params[:company_id],job_id: params[:job_id])