app/controllers/job_posts_controller.rb

SELECT `job_posts`.* FROM `job_posts`
---
  def index
    @job_posts = JobPost.all

SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1
SELECT  `company_details`.* FROM `company_details` WHERE `company_details`.`member_id` = 3 LIMIT 1
SELECT `company_details`.* FROM `company_details`
---
  def new
    tmp = Member.find_by_user_id(current_user.id)
    if tmp != nil
      if CompanyDetail.find_by_member_id(tmp.id) != nil
        @job_post = JobPost.new
        @company=CompanyDetail.all

SELECT `company_details`.* FROM `company_details`
---
  def edit
    @company=CompanyDetail.all

INSERT INTO `job_posts` (`company_id`, `required_on`, `etc`, `description`, `created_at`, `updated_at`) VALUES (1, 'Ruby', 15000, 'nothing', '2017-02-07 18:59:39', '2017-02-07 18:59:39')
---
  def create
    @job_post = JobPost.new(job_post_params)

    respond_to do |format|
      if @job_post.save

UPDATE `job_posts` SET `updated_at` = '2017-02-09 20:13:33', `member_id` = 3 WHERE `job_posts`.`id` = 1
---
  def update
    respond_to do |format|
      if @job_post.update(job_post_params)

DELETE FROM `job_posts` WHERE `job_posts`.`id` = 3
---
  def destroy
    @job_post.destroy

SELECT  `job_posts`.* FROM `job_posts` WHERE `job_posts`.`id` = 3 LIMIT 1
---
    def set_job_post
      @job_post = JobPost.find(params[:id])