app/controllers/members_controller.rb

  def index
    if Member.find_by_user_id(current_user.id) != nil
      me=Member.find_by_user_id(current_user.id)
      @members = Member.all
      @education_qualifications = EducationQualification.where(:member_id=>me.id)
      @experiences = Experience.where(:member_id=>me.id)
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 5 LIMIT 1
SELECT `members`.* FROM `members`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `education_qualifications`.* FROM `education_qualifications` WHERE `education_qualifications`.`member_id` = 1
SELECT `experiences`.* FROM `experiences` WHERE `experiences`.`member_id` = 1

  def new
    tmp=Member.find_by_user_id(current_user.id)
---
SELECT  `members`.* FROM `members` WHERE `members`.`user_id` = 1 LIMIT 1

  def create
    @member = Member.new(member_params)
    respond_to do |format|
      if @member.save
---
INSERT INTO `members` (`name`, `address1`, `address2`, `phone`, `email`, `photo`, `role`, `locations`, `links`, `description`, `father_name`, `created_at`, `updated_at`) VALUES ('Radha Krishnan', 'Tindivanam', 'Tindivanam', '1234567897', 'srk@gmail.com', 'images.jpg', 'Developer', 'Chennai', 'www.srk.com', 'greate genius', '1', '2017-02-10 04:56:21', '2017-02-10 04:56:21')

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE `members` SET `photo` = 'images.jpg', `father_name` = '0', `updated_at` = '2017-02-09 18:23:30' WHERE `members`.`id` = 3

  def destroy
    @member.destroy
---
DELETE FROM `members` WHERE `members`.`id` = 2

    def set_member
      @member = Member.find(params[:id])
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 7 LIMIT 1