app/controllers/requested_jobs_controller.rb

SELECT `requested_jobs`.* FROM `requested_jobs`
---
  def index
    @requested_jobs = RequestedJob.all